# **Notabiiy qiymatlar bilan ishlash**

Jadvalimizda notabiiy qiymatlar mavjud yoki mavjud emasligini har bir ustun uchun tekshiramiz. Notabiiy qiymatlarga ega qatorlarni esa tashlab yuboramiz

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/iRavshan/pro_data_scientist/main/datasets/study_performance.csv')

In [19]:
df.head(4)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44

In [21]:
df['gender'].unique()

array(['female', 'male', 'm', 'f'], dtype=object)

In [22]:
df['gender'].value_counts()

gender
female    511
male      477
f           7
m           5
Name: count, dtype: int64

In [24]:
df['gender'] = df['gender'].replace(["f", "m"], ["female", "male"])

In [25]:
df["gender"].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [27]:
df['race_ethnicity'].value_counts()

race_ethnicity
group C    319
group D    260
group B    190
group E    139
group A     88
group        4
Name: count, dtype: int64

In [28]:
df["race_ethnicity"] = df["race_ethnicity"].replace(["group"], ["group A"])

In [29]:
df["race_ethnicity"].value_counts()

race_ethnicity
group C    319
group D    260
group B    190
group E    139
group A     92
Name: count, dtype: int64

In [30]:
df['parental_level_of_education'].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school'],
      dtype=object)

In [31]:
df["lunch"].unique()

array(['standard', 'free/reduced', 'std'], dtype=object)

In [33]:
df["lunch"] = df["lunch"].replace(["std"], ["standard"])

In [34]:
df["lunch"].unique(df.hea

array(['standard', 'free/reduced'], dtype=object)

In [39]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [36]:
df["test_preparation_course"].unique()

array(['none', 'completed', nan], dtype=object)

In [38]:
df["test_preparation_course"].isnull().sum()

5

In [ ]:
df["test_preparation_course"].value_counts()

In [41]:
df["math_score"].describe()

count    1000.000000
mean       66.375000
std        19.446916
min       -95.000000
25%        57.000000
50%        66.000000
75%        77.000000
max       281.000000
Name: math_score, dtype: float64

In [42]:
def outliers(score):
    if score > 100:
        score = int(score % 100)
    elif score < 0:
        score = np.abs(score)
    return score    


df["math_score"] = df["math_score"].map(outliers)

In [43]:
df["math_score"].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math_score, dtype: float64

In [45]:
df['reading_score'].describe()

count    1000.000000
mean       69.241000
std        18.556165
min       -86.000000
25%        59.000000
50%        70.000000
75%        80.000000
max       266.000000
Name: reading_score, dtype: float64

In [46]:
df['reading_score'] = df['reading_score'].map(outliers)

In [47]:
df['reading_score'].describe()

count    1000.000000
mean       69.169000
std        14.600192
min        17.000000
25%        59.000000
50%        70.000000
75%        79.000000
max       100.000000
Name: reading_score, dtype: float64

In [48]:
df['writing_score'].describe()

count    1000.000000
mean       68.152000
std        16.290927
min       -51.000000
25%        57.750000
50%        69.000000
75%        79.000000
max       170.000000
Name: writing_score, dtype: float64

In [49]:
df['writing_score'] = df['writing_score'].map(outliers)

In [50]:
df['writing_score'].describe()

count    1000.000000
mean       68.054000
std        15.195657
min        10.000000
25%        57.750000
50%        69.000000
75%        79.000000
max       100.000000
Name: writing_score, dtype: float64

In [51]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [53]:
df['overall'] = df['math_score'] + df['reading_score'] + df['writing_score']
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,overall
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229

In [54]:
df['overall'].describe()

count    1000.000000
mean      203.312000
std        42.771978
min        27.000000
25%       175.000000
50%       205.000000
75%       233.000000
max       300.000000
Name: overall, dtype: float64

In [55]:
df[df['test_preparation_course'].isnull()]

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,overall
80,female,group B,associate's degree,standard,NaN,47,49,50,146
117,female,group D,bachelor's degree,standard,NaN,78,82,79,239
222,female,group C,some high school,free/reduced,NaN,55,65,62,182
671,male,group D,associate's degree,free/reduced,NaN,52,57,50,159
980,female,group B,high school,free/reduced,NaN,8,24,23,55

In [63]:
needed_indeces = df[df['test_preparation_course'].isnull()].index

In [64]:
for i in needed_indeces:
    if df.loc[i, 'overall'] < df['overall'].mean():
        df.loc[i, 'test_preparation_course'] = 'none'
    else:
        df.loc[i, 'test_preparation_course'] = 'completed'

In [65]:
df['test_preparation_course'].unique()

array(['none', 'completed'], dtype=object)

In [66]:
df['test_preparation_course'].value_counts()

test_preparation_course
none         642
completed    358
Name: count, dtype: int64

In [67]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,overall
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229

In [70]:
df[df.duplicated()]

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,overall
117,none,none,none,none,none,none,none,none,none
222,none,none,none,none,none,none,none,none,none
671,none,none,none,none,none,none,none,none,none
980,none,none,none,none,none,none,none,none,none

In [73]:
df.drop_duplicates(inplace=True)
df.duplicated().sum()

0

In [74]:
df.isnull().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
overall                        0
dtype: int64